src/InformationRegisters/КИИ_ПоколениеИндексаQdrant/КИИ_ПоколениеИндексаQdrant.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_ПоколениеИндексаQdrant</name>
  <comment>Build-marker: поколение индекса по модели + флаг ИндексПостроен (readiness-gate). Независимый непериодический.</comment>
  <resources>
    <name>Поколение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИндексПостроен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостроения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Размерность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_ОчередьСинхронизацииQdrant/КИИ_ОчередьСинхронизацииQdrant.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_ОчередьСинхронизацииQdrant</name>
  <comment>Outbox: очередь upsert/delete точек Qdrant. FIFO по НомерПоПорядку. Независимый непериодический.</comment>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Попыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяОшибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ФрагментИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_БэкендыВекторногоПоиска/КИИ_БэкендыВекторногоПоиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_БэкендыВекторногоПоиска</name>
  <comment>Активный бэкенд RAG-поиска: Нативный (линейный dot в 1С) или Qdrant (внешний ANN).</comment>
  <enumValues>
    <name>Нативный</name>
  </enumValues>
  <enumValues>
    <name>Qdrant</name>
  </enumValues>
</mdclass:Enum>

src/Enums/КИИ_ПолитикиЭмбеддинга/КИИ_ПолитикиЭмбеддинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_ПолитикиЭмбеддинга</name>
  <comment>Политика egress для эмбеддинга содержимого базы знаний во внешний API. ЗапрещеноВнешнее / ТолькоРФ / РазрешеноВнешнее. Применяется на категории и переопределяется на документе базы знаний.</comment>
  <enumValues>
    <name>ЗапрещеноВнешнее</name>
  </enumValues>
  <enumValues>
    <name>ТолькоРФ</name>
  </enumValues>
  <enumValues>
    <name>РазрешеноВнешнее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КИИ_ФрагментыЗнаний/КИИ_ФрагментыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_ФрагментыЗнаний</name>
  <comment>Подчиненный справочник (владелец = КИИ_БазаЗнаний). Чанки документа с нормализованным эмбеддингом, hash и кодом модели.</comment>
  <owners>Catalog.КИИ_БазаЗнаний</owners>
  <attributes>
    <name>НомерФрагмента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФрагмента</name>
    <comment>Чанк + заголовок документа в начале.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешТекстаФрагмента</name>
    <comment>SHA256 текста для stale detection.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Эмбеддинг</name>
    <comment>Нормализованный массив Число (|v|=1).</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаИсходная</name>
    <comment>|v| до нормализации (диагностика).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМоделиЭмбеддинга</name>
    <comment>Напр. openrouter:text-embedding-3-small — точный фильтр поиска.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размерность</name>
    <comment>assert (1536/256).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КИИ_БазаЗнаний/КИИ_БазаЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_БазаЗнаний</name>
  <comment>Документ-уровень базы знаний RAG. Разбивается на фрагменты (КИИ_ФрагментыЗнаний). Эмбеддинг хранится на фрагменте.</comment>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КИИ_КатегорииЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержимое</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПуть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолитикаЭмбеддингаПереопределение</name>
    <comment>Пусто = берется из Категории.</comment>
    <type>
      <types>EnumRef.КИИ_ПолитикиЭмбеддинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/КИИ_RAGQdrant/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает Истину, если активный бэкенд векторного поиска - Qdrant (внешний ANN).
// Дефолт (пустая константа) - Нативный.
//
// Возвращаемое значение:
//  Булево
Функция ЭтоБэкендQdrant() Экспорт
	Возврат Константы.КИИ_БэкендВекторногоПоиска.Получить() = Перечисления.КИИ_БэкендыВекторногоПоиска.Qdrant;
КонецФункции

// Рантайм-доступность Qdrant (GET /readyz = 200). НЕ путать с ИндексПостроен (build-marker).
//
// Возвращаемое значение:
//  Булево
Функция QdrantДоступен() Экспорт
	Попытка
		Ответ = ВыполнитьЗапросQdrant("GET", "/readyz");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Ответ.КодСостояния = 200;
КонецФункции

// Признак того, что индекс модели когда-либо полностью залит (build-marker из
// РегистрСведений.КИИ_ПоколениеИндексаQdrant). Стартовый гейт диспетчера (§8), НЕ рантайм.
//
// Параметры:
//  КодМодели - Строка - код модели эмбеддинга
//
// Возвращаемое значение:
//  Булево
Функция ИндексПостроен(Знач КодМодели) Экспорт
	Отбор = Новый Структура("КодМодели", КодМодели);
	Данные = РегистрыСведений.КИИ_ПоколениеИндексаQdrant.Получить(Отбор);
	Возврат Данные.ИндексПостроен = Истина;
КонецФункции

// Записывает build-marker поколения индекса модели (readiness-gate §8). Размерность коллекции
// сохраняется (ее пишет ОбеспечитьКоллекцию) - здесь не затирается.
//
// Параметры:
//  КодМодели      - Строка
//  ИндексПостроен - Булево - индекс полностью залит
//  Поколение      - Число, Неопределено - если задано, устанавливает; иначе инкремент
Процедура ОтметитьПоколение(Знач КодМодели, Знач ИндексПостроен, Знач Поколение = Неопределено) Экспорт
	Отбор = Новый Структура("КодМодели", КодМодели);
	Текущее = РегистрыСведений.КИИ_ПоколениеИндексаQdrant.Получить(Отбор);
	Если Поколение <> Неопределено Тогда
		НовоеПоколение = Поколение;
	Иначе
		ТекущееПоколение = 0;
		Если ЗначениеЗаполнено(Текущее.Поколение) Тогда
			ТекущееПоколение = Текущее.Поколение;
		КонецЕсли;
		// Индекс достроен - поколение фиксируем; иначе инкремент: читатели по старому
		// поколению должны увидеть, что индекс сменился и их снимок неактуален.
		Если ИндексПостроен Тогда
			НовоеПоколение = ТекущееПоколение;
		Иначе
			НовоеПоколение = ТекущееПоколение + 1;
		КонецЕсли;
	КонецЕсли;

	Запись = РегистрыСведений.КИИ_ПоколениеИндексаQdrant.СоздатьМенеджерЗаписи();
	Запись.КодМодели = КодМодели;
	Запись.Поколение = НовоеПоколение;
	Запись.ИндексПостроен = ИндексПостроен;
	Запись.ДатаПостроения = ТекущаяДатаСеанса();
	Запись.Размерность = Текущее.Размерность;
	Запись.Записать();
КонецПроцедуры

// Строгий tenant_id инфобазы (§4): детерминирован из деплой-контура (строка соединения +
// имя сервера), закеширован в константе. Reset-on-clone: если закешированное значение не
// совпадает с текущим деплой-значением (копия ИБ) - перегенерируется, старые коллекции клона
// осиротеют (чистятся reconciliation'ом). Дальнейшие вызовы возвращают кеш.
//
// Возвращаемое значение:
//  Строка - 16 hex-символов
Функция ВычислитьTenantId() Экспорт
	Ожидаемый = TenantИзОкружения();
	Закешированный = СокрЛП(Константы.КИИ_ИдентификаторTenantQdrant.Получить());
	Если ЗначениеЗаполнено(Закешированный) И Закешированный = Ожидаемый Тогда
		Возврат Закешированный;
	КонецЕсли;
	// Пусто ИЛИ рассинхрон (клон) - перегенерировать и закешировать.
	УстановитьПривилегированныйРежим(Истина);
	Константы.КИИ_ИдентификаторTenantQdrant.Установить(Ожидаемый);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ожидаемый;
КонецФункции

// Имя коллекции = iikona_<tenant>_<provider>_<model>_<dim>_v<schema>, санировано [a-z0-9_] (§3).
// tenant разводит dev/prod-клоны на одном Qdrant; provider/model не смешивают эмбеддеры;
// dim фиксирует размерность; schema позволяет миграцию payload без коллизий.
//
// Параметры:
//  КодМодели   - Строка - напр. "openrouter:text-embedding-3-small"
//  Размерность - Число
//
// Возвращаемое значение:
//  Строка
Функция ИмяКоллекции(Знач КодМодели, Знач Размерность) Экспорт
	Части = Новый Массив;
	Части.Добавить("iikona");
	Части.Добавить(ВычислитьTenantId());
	Части.Добавить(СанироватьИмя(КодМодели));
	Части.Добавить(Формат(Размерность, "ЧГ=0"));
	Части.Добавить("v" + Формат(ВерсияСхемы(), "ЧГ=0"));
	Возврат СтрСоединить(Части, "_");
КонецФункции

// Детерминированный идентификатор точки для фрагмента: UUIDv5-подобный (SHA1 от namespace=tenant
// и name=UUID фрагмента) (§3). Идемпотентен, не коллизирует между клонами ИБ (разный tenant).
// point id необратим → uuid фрагмента дополнительно кладется в payload для rehydrate.
//
// Параметры:
//  ФрагментUUID - Строка - УникальныйИдентификатор ссылки фрагмента строкой
//
// Возвращаемое значение:
//  Строка - UUID-строка формата 8-4-4-4-12
Функция PointId(Знач ФрагментUUID) Экспорт
	Основа = ВычислитьTenantId() + ":" + СокрЛП(ФрагментUUID);
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(Основа);
	Хекс = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));
	Хекс = СтрЗаменить(СтрЗаменить(Хекс, " ", ""), Символы.ПС, "");
	Хекс = Лев(Хекс, 32);
	// Проставить версию (5) и вариант (10xx) как в RFC UUIDv5.
	Хекс = Лев(Хекс, 12) + "5" + Сред(Хекс, 14, 3) + ВариантныйНиббл(Сред(Хекс, 17, 1)) + Сред(Хекс, 18);
	Возврат Лев(Хекс, 8) + "-" + Сред(Хекс, 9, 4) + "-" + Сред(Хекс, 13, 4)
		+ "-" + Сред(Хекс, 17, 4) + "-" + Сред(Хекс, 21, 12);
КонецФункции

// Обеспечивает существование коллекции модели и payload-индексов (uuid для фрагмент/базаЗнаний,
// keyword для категория/политика) - ДО заливки (§3). Идемпотентно. Запоминает размерность
// коллекции в build-marker (нужна для delete, когда фрагмент уже удален).
//
// Решение по результату GET-проверки коллекции Qdrant: "create" (404), "exists" (2xx), "error" (иначе).
// Параметры:
//  КодСостояния - Число - HTTP-код ответа GET-проверки коллекции.
//  Успешно - Булево - успешен ли HTTP-запрос проверки коллекции.
// Возвращаемое значение:
//  Строка - решение: "create", "exists" или "error".
// Раньше любой не-404 трактовался как «коллекция есть» → при 5xx/таймауте/403 создание молча
// пропускалось, а последующие upsert падали на отсутствующей коллекции (аудит P3).
Функция РешениеПоПроверкеКоллекции(Знач КодСостояния, Знач Успешно) Экспорт
	Если КодСостояния = 404 Тогда
		Возврат "create";
	ИначеЕсли Успешно Тогда
		Возврат "exists";
	Иначе
		// 5xx / таймаут / 403: состояние коллекции неизвестно. Раньше любой не-404 считался
		// "коллекция есть" - создание молча пропускалось, upsert падал (аудит P3).
		Возврат "error";
	КонецЕсли;
КонецФункции

// Обеспечивает существование коллекции Qdrant для модели (создает при 404, иначе проверяет наличие).
// Параметры:
//  КодМодели - Строка - идентификатор модели эмбеддингов.
//  Размерность - Число - размерность вектора.
// Возвращаемое значение:
//  Строка - имя обеспеченной коллекции.
Функция ОбеспечитьКоллекцию(Знач КодМодели, Знач Размерность) Экспорт
	Имя = ИмяКоллекции(КодМодели, Размерность);
	Проверка = ВыполнитьЗапросQdrant("GET", "/collections/" + Имя);
	Решение = РешениеПоПроверкеКоллекции(Проверка.КодСостояния, Проверка.Успешно);
	Если Решение = "error" Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Проверка коллекции Qdrant %1 не удалась: HTTP %2 %3'"),
			Имя, Проверка.КодСостояния, Проверка.Тело);
	КонецЕсли;
	Если Решение = "create" Тогда
		ТелоСоздания = Новый Структура;
		Векторы = Новый Структура;
		Векторы.Вставить("size", Размерность);
		Векторы.Вставить("distance", "Dot");
		ТелоСоздания.Вставить("vectors", Векторы);
		Создание = ВыполнитьЗапросQdrant("PUT", "/collections/" + Имя, ТелоСоздания);
		Если Не Создание.Успешно Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось создать коллекцию Qdrant %1: HTTP %2 %3'"),
				Имя, Создание.КодСостояния, Создание.Тело);
		КонецЕсли;
		СоздатьИндексПоля(Имя, "фрагмент", "uuid");
		СоздатьИндексПоля(Имя, "базаЗнаний", "uuid");
		СоздатьИндексПоля(Имя, "категория", "keyword");
		СоздатьИндексПоля(Имя, "политика", "keyword");
	КонецЕсли;
	ЗапомнитьРазмерностьКоллекции(КодМодели, Размерность);
	Возврат Имя;
КонецФункции

// Ставит операцию синхронизации в outbox (РегистрСведений.КИИ_ОчередьСинхронизацииQdrant).
// Вызывается ТОЛЬКО в той же транзакции, что и запись фрагмента (§5). Для upsert - только со
// свежим вектором. FIFO по НомерПоПорядку (миллисекунды универсальной даты). Т.к. измерения =
// (фрагмент, модель), повторный enqueue перезаписывает прежнюю операцию (коалесцирование): при
// стабильном point-id это корректно (последняя операция отражает целевое состояние точки).
//
// Параметры:
//  ФрагментUUID - Строка - идентификатор фрагмента строкой (переживает удаление ссылки)
//  КодМодели    - Строка
//  Операция     - Строка - "upsert" | "delete"
//  Хеш          - Строка - хеш текста, под который посчитан вектор (для upsert)
Процедура ПоставитьВОчередь(Знач ФрагментUUID, Знач КодМодели, Знач Операция, Знач Хеш = "") Экспорт
	Запись = РегистрыСведений.КИИ_ОчередьСинхронизацииQdrant.СоздатьМенеджерЗаписи();
	Запись.ФрагментИдентификатор = СокрЛП(ФрагментUUID);
	Запись.КодМодели = КодМодели;
	Запись.НомерПоПорядку = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.Операция = Операция;
	Запись.Хеш = Хеш;
	Запись.Попыток = 0;
	Запись.ПоследняяОшибка = "";
	Запись.ДатаПостановки = ТекущаяДатаСеанса();
	Запись.Записать();
КонецПроцедуры

// Диспетчер outbox (регламентное задание): осушает очередь FIFO-батчами, применяя upsert/delete
// в Qdrant с wait=true. Успех → строка снимается (404 идемпотентно игнорируется). Ошибка →
// Попыток++, ПоследняяОшибка (backoff до следующего запуска). «Ядовитые» строки (Попыток ≥ ЛимитПопыток)
// исключаются из выборки, чтобы не блокировать очередь. Платформенная сериализация регламентного
// задания дает singleton по себе.
Процедура ОбработатьОчередь() Экспорт
	ИмяСобытия = НСтр("ru = 'КИИ.RAGQdrant.Очередь'");
	Если Не QdrantДоступен() Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , ,
			НСтр("ru = 'Qdrant недоступен (/readyz ≠ 200); обработка очереди отложена'"));
		Возврат;
	КонецЕсли;

	Для Каждого Элемент Из ВыбратьЭлементыОчереди() Цикл
		Попытка
			ОбработатьЭлементОчереди(Элемент);
			УдалитьСтрокуОчереди(Элемент.ФрагментИдентификатор, Элемент.КодМодели, Элемент.НомерПоПорядку);
		Исключение
			ОтметитьОшибкуОчереди(Элемент, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

// Выбирает элементы очереди FIFO-батчем (ПЕРВЫЕ 256, УПОРЯДОЧИТЬ ПО НомерПоПорядку), исключая
// «ядовитые» строки (Попыток ≥ лимит), чтобы они не блокировали очередь. Вынесено из
// ОбработатьОчередь для тестируемости poison-exclusion и порядка (аудит: тест-гэп).
//
// Возвращаемое значение:
//  Массив из Структура - элементы очереди (ФрагментИдентификатор, КодМодели, Операция, Хеш,
//                        Попыток, НомерПоПорядку)
Функция ВыбратьЭлементыОчереди() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛимитПопыток", ЛимитПопытокОчереди());
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 256
		|	Очередь.ФрагментИдентификатор КАК ФрагментИдентификатор,
		|	Очередь.КодМодели КАК КодМодели,
		|	Очередь.Операция КАК Операция,
		|	Очередь.Хеш КАК Хеш,
		|	Очередь.Попыток КАК Попыток,
		|	Очередь.НомерПоПорядку КАК НомерПоПорядку
		|ИЗ
		|	РегистрСведений.КИИ_ОчередьСинхронизацииQdrant КАК Очередь
		|ГДЕ
		|	Очередь.Попыток < &ЛимитПопыток
		|УПОРЯДОЧИТЬ ПО
		|	Очередь.НомерПоПорядку";
	Выборка = Запрос.Выполнить().Выбрать();

	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура("ФрагментИдентификатор, КодМодели, Операция",
			Выборка.ФрагментИдентификатор, Выборка.КодМодели, Выборка.Операция);
		Элемент.Вставить("Хеш", Выборка.Хеш);
		Элемент.Вставить("Попыток", Выборка.Попыток);
		Элемент.Вставить("НомерПоПорядку", Выборка.НомерПоПорядку);
		Результат.Добавить(Элемент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Поиск по вектору через Qdrant Query API (§6). Возвращает ту же структуру, что нативный
// КИИ_RAG.ПоискПоВектору. Rehydrate текста и re-check политики (ЗапрещеноВнешнее → исключить +
// enqueue delete) выполняется здесь; consumer-policy-check (ТолькоРФ vs чат-модель) - снаружи,
// перед подмешиванием (общая РазрешенФрагментДляМодели). Транспортные ошибки → APIОшибка (graceful).
//
// Параметры:
//  ЭмбеддингЗапроса - Массив из Число - нормализованный вектор запроса
//  Категории        - Массив из СправочникСсылка.КИИ_КатегорииЗнаний,
//                     СправочникСсылка.КИИ_КатегорииЗнаний, Неопределено - фильтр категорий
//  Топ              - Число
//  ПорогСходства    - Число - score_threshold, диапазон [-1,1] для Dot
//  КодМодели        - Строка
//  Размерность      - Число
//  ВладелецБаза     - СправочникСсылка.КИИ_БазаЗнаний, Неопределено - owner-фильтр
//
// Возвращаемое значение:
//  Структура - результат поиска:
//   * Знания - Массив из Структура - найденные фрагменты (Ссылка, Текст, Категория, Score)
//   * Статус - Строка - код статуса (ОК, НетИндекса, APIОшибка, ВсеНижеПорога)
//   * Диагностика - Строка - пояснение статуса
Функция Поиск(Знач ЭмбеддингЗапроса, Знач Категории, Знач Топ, Знач ПорогСходства,
	Знач КодМодели, Знач Размерность, Знач ВладелецБаза = Неопределено) Экспорт
	Имя = ИмяКоллекции(КодМодели, Размерность);
	Тело = ПостроитьТелоПоиска(ЭмбеддингЗапроса, Топ, ПорогСходства, Категории, ВладелецБаза);

	Попытка
		Ответ = ВыполнитьЗапросQdrant("POST", "/collections/" + Имя + "/points/query", Тело);
	Исключение
		ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Qdrant недоступен: %1'"), ПредставлениеОшибки);
		Возврат РезультатПоиска("APIОшибка", ТекстОшибки);
	КонецПопытки;

	Если Ответ.КодСостояния = 404 Тогда
		Возврат РезультатПоиска("НетИндекса", НСтр("ru = 'Коллекция Qdrant не найдена'"));
	КонецЕсли;
	Если Не Ответ.Успешно Тогда
		Возврат РезультатПоиска("APIОшибка", СтрШаблон(НСтр("ru = 'Qdrant вернул HTTP %1'"), Ответ.КодСостояния));
	КонецЕсли;

	РазобранныйОтвет = КИИ_HTTPКлиент.JsonВСтруктуру(Ответ.Тело, Истина);
	Возврат РазобратьОтветПоиска(РазобранныйОтвет, КодМодели);
КонецФункции

// Строит тело запроса Qdrant Query API (чистая функция, тестируется на фикстуре).
//
// Параметры:
//  ЭмбеддингЗапроса - Массив из Число - вектор запроса
//  Топ              - Число
//  ПорогСходства    - Число
//  Категории        - Массив из СправочникСсылка.КИИ_КатегорииЗнаний,
//                     СправочникСсылка.КИИ_КатегорииЗнаний, Неопределено - фильтр категорий
//  ВладелецБаза     - СправочникСсылка.КИИ_БазаЗнаний, Неопределено - owner-фильтр
//
// Возвращаемое значение:
//  Структура - тело запроса Qdrant Query API:
//   * query - Массив из Число - вектор запроса
//   * limit - Число - максимум точек
//   * score_threshold - Число - порог score
//   * with_payload - Массив из Строка - имена полей payload
//   * filter - Структура - фильтр (опционально)
Функция ПостроитьТелоПоиска(Знач ЭмбеддингЗапроса, Знач Топ, Знач ПорогСходства,
	Знач Категории, Знач ВладелецБаза = Неопределено) Экспорт
	Тело = Новый Структура;
	Тело.Вставить("query", ЭмбеддингЗапроса);
	Тело.Вставить("limit", Топ);
	Тело.Вставить("score_threshold", ПорогСходства);

	СПолями = Новый Массив;
	СПолями.Добавить("базаЗнаний");
	СПолями.Добавить("категория");
	СПолями.Добавить("номер");
	СПолями.Добавить("политика");
	СПолями.Добавить("фрагмент");
	Тело.Вставить("with_payload", СПолями);

	Условия = Новый Массив;
	Если ВладелецБаза <> Неопределено И ЗначениеЗаполнено(ВладелецБаза) Тогда
		Условия.Добавить(УсловиеСовпадения("базаЗнаний", Строка(ВладелецБаза.УникальныйИдентификатор())));
	КонецЕсли;
	СписокКатегорий = ИдентификаторыКатегорий(Категории);
	Если СписокКатегорий.Количество() > 0 Тогда
		Совпадение = Новый Структура("any", СписокКатегорий);
		Условие = Новый Структура;
		Условие.Вставить("key", "категория");
		Условие.Вставить("match", Совпадение);
		Условия.Добавить(Условие);
	КонецЕсли;
	Если Условия.Количество() > 0 Тогда
		Фильтр = Новый Структура("must", Условия);
		Тело.Вставить("filter", Фильтр);
	КонецЕсли;

	Возврат Тело;
КонецФункции

// Разбирает ответ Query API в структуру результата (чистая функция, тестируется на фикстуре).
// Rehydrate текста и re-check политики - из 1С по payload.фрагмент (point id необратим, §6).
// Фрагмент удален / политика теперь ЗапрещеноВнешнее → исключается и ставится delete в очередь.
//
// Параметры:
//  Ответ     - Соответствие из КлючИЗначение - десериализованный JSON ответа Qdrant
//  КодМодели - Строка
//
// Возвращаемое значение:
//  Структура - результат поиска:
//   * Знания - Массив из Структура - найденные фрагменты (Ссылка, Текст, Категория, Score)
//   * Статус - Строка - код статуса
//   * Диагностика - Строка - пояснение статуса
Функция РазобратьОтветПоиска(Знач Ответ, Знач КодМодели) Экспорт
	Результат = РезультатПоиска("ОК", "");
	Точки = ТочкиИзОтвета(Ответ);
	Если Точки = Неопределено Тогда
		Результат.Статус = "APIОшибка";
		Результат.Диагностика = НСтр("ru = 'Неожиданный формат ответа Qdrant'");
		Возврат Результат;
	КонецЕсли;

	Для Каждого Точка Из Точки Цикл
		Payload = ЗначениеСоответствия(Точка, "payload");
		Если Payload = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ФрагментUUID = СтрокаИзСоответствия(Payload, "фрагмент");
		Если Не ЗначениеЗаполнено(ФрагментUUID) Тогда
			Продолжить;
		КонецЕсли;
		Фрагмент = ФрагментПоUUID(ФрагментUUID);
		Если Фрагмент = Неопределено Тогда
			// Осиротевшая точка - фрагмент отсутствует в 1С: убрать из индекса.
			ПоставитьВОчередьБезопасно(ФрагментUUID, КодМодели, "delete");
			Продолжить;
		КонецЕсли;
		Если Не РазрешеноВИндексе(Фрагмент.ЭффективнаяПолитика) Тогда
			ПоставитьВОчередьБезопасно(ФрагментUUID, КодМодели, "delete");
			Продолжить;
		КонецЕсли;
		Запись = Новый Структура("Ссылка, Текст, Категория");
		Запись.Ссылка = Фрагмент.Ссылка;
		Запись.Текст = Фрагмент.ТекстФрагмента;
		Запись.Категория = Фрагмент.Категория;
		Запись.Вставить("Score", ЧислоИзСоответствия(Точка, "score"));
		Результат.Знания.Добавить(Запись);
	КонецЦикла;

	Если Результат.Знания.Количество() = 0 Тогда
		Если Точки.Количество() = 0 Тогда
			Результат.Статус = "ВсеНижеПорога";
			Результат.Диагностика = НСтр("ru = 'Совпадений выше порога не найдено'");
		Иначе
			// Qdrant вернул точки, но все отсеяны (осиротевшие/по политике) - это НЕ «ниже порога» (аудит P3).
			Результат.Статус = "ВсеОтфильтрованы";
			Результат.Диагностика = НСтр("ru = 'Совпадения есть, но все отфильтрованы (осиротевшие или по политике)'");
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Consumer-policy-check (§7): можно ли подмешать фрагмент данной политики в чат-модель данного
// класса egress. ТолькоРФ-контент - лишь в модель РФ-класса; ЗапрещеноВнешнее - никогда.
// Общая для обоих бэкендов (native + Qdrant), применяется перед ПодмешатьКонтекст.
//
// Параметры:
//  ПолитикаФрагмента     - ПеречислениеСсылка.КИИ_ПолитикиЭмбеддинга
//  КлассEgressЧатМодели  - ПеречислениеСсылка.КИИ_ПолитикиЭмбеддинга - класс egress чат-модели
//
// Возвращаемое значение:
//  Булево
Функция РазрешенФрагментДляМодели(Знач ПолитикаФрагмента, Знач КлассEgressЧатМодели) Экспорт
	Если ПолитикаФрагмента = Перечисления.КИИ_ПолитикиЭмбеддинга.ЗапрещеноВнешнее Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ПолитикаФрагмента = Перечисления.КИИ_ПолитикиЭмбеддинга.ТолькоРФ Тогда
		Возврат КлассEgressЧатМодели = Перечисления.КИИ_ПолитикиЭмбеддинга.ТолькоРФ;
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Санирует компонент имени коллекции до [a-z0-9_] (нижний регистр, прочее → "_").
//
// Параметры:
//  Значение - Строка
//
// Возвращаемое значение:
//  Строка
Функция СанироватьИмя(Знач Значение) Экспорт
	Исходная = НРег(СокрЛП(Значение));
	Разрешено = "abcdefghijklmnopqrstuvwxyz0123456789_";
	Результат = "";
	Для Позиция = 1 По СтрДлина(Исходная) Цикл
		Символ = Сред(Исходная, Позиция, 1);
		Результат = Результат + ?(СтрНайти(Разрешено, Символ) > 0, Символ, "_");
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Пересборка коллекции модели в blue-green (§5): поднимает поколение и закрывает readiness-gate
// на время пересборки (диспетчер уходит в native - стартовый гейт, не рантайм-fallback), затем
// заполняет заново и открывает гейт. MVP: пересборка в ту же коллекцию (одна модель).
//
// Параметры:
//  КодМодели   - Строка
//  Размерность - Число
//
// Возвращаемое значение:
//  Структура - счетчики заливки:
//   * Залито - Число - успешно залито точек
//   * Всего - Число - всего фрагментов модели
Функция ПересобратьКоллекцию(Знач КодМодели, Знач Размерность) Экспорт
	ОтметитьПоколение(КодМодели, Ложь);
	ОбеспечитьКоллекцию(КодМодели, Размерность);

	Всего = 0;
	Залито = 0;
	Выборка = ФрагментыМодели(КодМодели);
	Пока Выборка.Следующий() Цикл
		Всего = Всего + 1;
		Попытка
			ЗалитьФрагментВQdrant(Выборка, КодМодели, Размерность);
			Залито = Залито + 1;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.RAGQdrant.Пересборка'"),
				УровеньЖурналаРегистрации.Ошибка, , Выборка.Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	// Готовым помечаем ТОЛЬКО при полном успехе. При частичном провале индекс
	// остается непостроенным - диспетчер продолжает fallback на native-поиск,
	// а не переключает боевой поиск на неполный Qdrant-индекс.
	Если Залито = Всего Тогда
		ОтметитьПоколение(КодМодели, Истина);
	Иначе
		ТекстДляЖурнала = СтрШаблон(
			НСтр("ru = 'Пересборка неполная: залито %1 из %2; индекс НЕ помечен готовым'"),
			Залито, Всего);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.RAGQdrant.Пересборка'"),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстДляЖурнала);
	КонецЕсли;
	Возврат Новый Структура("Залито, Всего", Залито, Всего);
КонецФункции

// Reconciliation (§5): проходит точки Qdrant по коллекции модели, удаляет осиротевшие (фрагмент
// отсутствует в 1С / на удаление / политика ЗапрещеноВнешнее); пропуски (эмбедденные фрагменты
// 1С без точки) ставит на upsert. MVP-скан ≤256 через scroll.
//
// Параметры:
//  КодМодели   - Строка
//  Размерность - Число
//
// Возвращаемое значение:
//  Структура - счетчики сверки:
//   * Удалено - Число - осиротевших точек поставлено на удаление
//   * Поставлено - Число - пропущенных фрагментов поставлено на upsert
Функция Сверить(Знач КодМодели, Знач Размерность) Экспорт
	Имя = ИмяКоллекции(КодМодели, Размерность);
	Удалено = ПоставитьУдаленияОсиротевшихТочек(КодМодели, Имя);
	Поставлено = 0;

	// Пропуски: эмбедденные фрагменты модели без флага в очереди - поставить upsert.
	Выборка = ФрагментыМодели(КодМодели);
	Пока Выборка.Следующий() Цикл
		Если РазрешеноВИндексе(Выборка.ЭффективнаяПолитика) Тогда
			ПоставитьВОчередьБезопасно(Строка(Выборка.Ссылка.УникальныйИдентификатор()),
				КодМодели, "upsert", Выборка.ХешТекстаФрагмента);
			Поставлено = Поставлено + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат Новый Структура("Удалено, Поставлено", Удалено, Поставлено);
КонецФункции

// Reconciliation по всем моделям с построенным индексом (parameterless - для регламентного
// задания; сам Сверить требует КодМодели/Размерность). Затем осушает очередь.
Процедура СверитьВсе() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Поколение.КодМодели КАК КодМодели,
		|	Поколение.Размерность КАК Размерность
		|ИЗ
		|	РегистрСведений.КИИ_ПоколениеИндексаQdrant КАК Поколение
		|ГДЕ
		|	Поколение.ИндексПостроен
		|	И Поколение.Размерность > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сверить(Выборка.КодМодели, Выборка.Размерность);
	КонецЦикла;
	ОбработатьОчередь();
КонецПроцедуры

// Единственная точка HTTP к Qdrant (seam §4/§11). Тестируется на фикстуре. Собирает URL из
// константы-адреса + путь, добавляет api-key из БезопасногоХранилища (если задан), таймаут 5с.
//
// Параметры:
//  Метод - Строка - GET | PUT | POST | DELETE
//  Путь  - Строка - напр. "/collections/x/points/query"
//  Тело  - Структура, Соответствие из КлючИЗначение, Строка, Неопределено - тело запроса
//
// Возвращаемое значение:
//  Структура - результат HTTP-запроса:
//   * КодСостояния - Число - HTTP-код ответа
//   * Тело - Строка - тело ответа
//   * Заголовки - Соответствие из КлючИЗначение - заголовки ответа
//   * Успешно - Булево - Истина при коде 2xx
Функция ВыполнитьЗапросQdrant(Знач Метод, Знач Путь, Знач Тело = Неопределено) Экспорт
	URL = АдресQdrant() + Путь;
	Заголовки = Новый Соответствие;
	Ключ = КлючAPI();
	Если ЗначениеЗаполнено(Ключ) Тогда
		Заголовки.Вставить("api-key", Ключ);
	КонецЕсли;
	Возврат КИИ_HTTPКлиент.ВыполнитьЗапрос(Метод, URL, Тело, Заголовки, ТаймаутПодключения(), ПрямоеСоединение());
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Фаза удаления сверки: ставит delete для осиротевших точек Qdrant (фрагмент
// не найден в 1С либо запрещен egress-политикой). Возвращает число поставленных удалений.
Функция ПоставитьУдаленияОсиротевшихТочек(Знач КодМодели, Знач Имя)

	Удалено = 0;

	ТелоScroll = Новый Структура;
	ТелоScroll.Вставить("limit", 256);
	СПолями = Новый Массив;
	СПолями.Добавить("фрагмент");
	ТелоScroll.Вставить("with_payload", СПолями);
	Ответ = ВыполнитьЗапросQdrant("POST", "/collections/" + Имя + "/points/scroll", ТелоScroll);
	Если Не Ответ.Успешно Тогда
		Возврат Удалено;
	КонецЕсли;

	Разобрано = КИИ_HTTPКлиент.JsonВСтруктуру(Ответ.Тело, Истина);
	Результат = ЗначениеСоответствия(Разобрано, "result");
	Точки = ?(Результат = Неопределено, Неопределено, ЗначениеСоответствия(Результат, "points"));
	Если ТипЗнч(Точки) <> Тип("Массив") Тогда
		Возврат Удалено;
	КонецЕсли;

	Для Каждого Точка Из Точки Цикл
		Payload = ЗначениеСоответствия(Точка, "payload");
		ФрагментUUID = ?(Payload = Неопределено, "", СтрокаИзСоответствия(Payload, "фрагмент"));
		Фрагмент = ?(ЗначениеЗаполнено(ФрагментUUID), ФрагментПоUUID(ФрагментUUID), Неопределено);
		Если Фрагмент = Неопределено Или Не РазрешеноВИндексе(Фрагмент.ЭффективнаяПолитика) Тогда
			ПоставитьВОчередьБезопасно(ФрагментUUID, КодМодели, "delete");
			Удалено = Удалено + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат Удалено;

КонецФункции

// Деплой-значение tenant: SHA256(строка соединения ИБ + имя компьютера сервера)[:16 hex].
Функция TenantИзОкружения()
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	ИмяКомпьютераСервера = ИмяКомпьютера();
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(СтрокаСоединения + "|" + ИмяКомпьютераСервера);
	Хекс = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));
	Хекс = СтрЗаменить(СтрЗаменить(Хекс, " ", ""), Символы.ПС, "");
	Возврат Лев(Хекс, 16);
КонецФункции

// Отображает исходный ниббл в вариант UUID (10xx → hex 8..b), сохраняя 2 бита энтропии.
Функция ВариантныйНиббл(Знач Символ)
	Значения = "0123456789abcdef";
	Индекс = СтрНайти(Значения, НРег(Символ)) - 1;
	Если Индекс < 0 Тогда
		Индекс = 0;
	КонецЕсли;
	Варианты = "89ab";
	Возврат Сред(Варианты, (Индекс % 4) + 1, 1);
КонецФункции

Функция АдресQdrant()
	Адрес = СокрЛП(Константы.КИИ_QdrantАдрес.Получить());
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		// Стандартный локальный Qdrant; свой сервер задается константой КИИ_QdrantАдрес.
		// BSLLS:UsingHardcodeNetworkAddress-off
		Адрес = "http://localhost:6333";
		// BSLLS:UsingHardcodeNetworkAddress-on
	КонецЕсли;
	Пока СтрДлина(Адрес) > 0 И Прав(Адрес, 1) = "/" Цикл
		Адрес = Лев(Адрес, СтрДлина(Адрес) - 1);
	КонецЦикла;
	Возврат Адрес;
КонецФункции

Функция ТаймаутПодключения()
	// NAS-хранилище Qdrant: create/delete коллекции наблюдались 20-37с (медленный I/O тома);
	// GET/query - миллисекунды. Таймаут с запасом под структурные операции; readiness-gate
	// (QdrantДоступен по /readyz) отсекает реально мертвый Qdrant до тяжелых вызовов.
	Возврат 90;
КонецФункции

// Прямое соединение (без системного прокси). Qdrant - LAN, а системный SOCKS-прокси (xkeen)
// дропает PUT/DELETE (проверено: через SOCKS 127.0.0.1:10808 GET проходит, PUT/DELETE таймаутят).
// Системный прокси нужен только для внешних вызовов (OpenRouter) - они идут своим путем.
Функция ПрямоеСоединение()
	Возврат Новый ИнтернетПрокси(Ложь);
КонецФункции

Функция ЛимитПопытокОчереди()
	Возврат 10;
КонецФункции

Функция ВерсияСхемы()
	Значение = Константы.КИИ_ВерсияСхемыQdrant.Получить();
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, 1);
КонецФункции

Функция КлючAPI()
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("КИИ_RAGQdrant", "КлючAPI");
КонецФункции

Функция РезультатПоиска(Знач Статус, Знач Диагностика)
	Результат = Новый Структура;
	Результат.Вставить("Знания", Новый Массив);
	Результат.Вставить("Статус", Статус);
	Результат.Вставить("Диагностика", Диагностика);
	Возврат Результат;
КонецФункции

Функция УсловиеСовпадения(Знач Ключ, Знач Значение)
	Совпадение = Новый Структура("value", Значение);
	Условие = Новый Структура;
	Условие.Вставить("key", Ключ);
	Условие.Вставить("match", Совпадение);
	Возврат Условие;
КонецФункции

Функция ИдентификаторыКатегорий(Знач Категории)
	Результат = Новый Массив;
	Если Категории = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Если ТипЗнч(Категории) = Тип("Массив") Тогда
		Для Каждого Категория Из Категории Цикл
			Если ЗначениеЗаполнено(Категория) Тогда
				Результат.Добавить(Строка(Категория.УникальныйИдентификатор()));
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(Категории) Тогда
		Результат.Добавить(Строка(Категории.УникальныйИдентификатор()));
	Иначе
		// Категории не заданы (пустая ссылка / Неопределено) - фильтра по категориям нет.
		Возврат Результат;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РазрешеноВИндексе(Знач ЭффективнаяПолитика)
	Возврат ЭффективнаяПолитика <> Перечисления.КИИ_ПолитикиЭмбеддинга.ЗапрещеноВнешнее;
КонецФункции

Функция ТочкиИзОтвета(Знач Ответ)
	Результат = ЗначениеСоответствия(Ответ, "result");
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Точки = ЗначениеСоответствия(Результат, "points");
	Если ТипЗнч(Точки) = Тип("Массив") Тогда
		Возврат Точки;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ЗначениеСоответствия(Знач Источник, Знач Ключ)
	Если ТипЗнч(Источник) = Тип("Соответствие") Тогда
		Возврат Источник.Получить(Ключ);
	ИначеЕсли ТипЗнч(Источник) = Тип("Структура") И Источник.Свойство(Ключ) Тогда
		Возврат Источник[Ключ];
	Иначе
		// Не JSON-объект либо нет такого ключа - значения нет.
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СтрокаИзСоответствия(Знач Источник, Знач Ключ)
	Значение = ЗначениеСоответствия(Источник, Ключ);
	Возврат ?(Значение = Неопределено, "", СокрЛП(Строка(Значение)));
КонецФункции

Функция ЧислоИзСоответствия(Знач Источник, Знач Ключ)
	Значение = ЗначениеСоответствия(Источник, Ключ);
	Возврат ?(ТипЗнч(Значение) = Тип("Число"), Значение, 0);
КонецФункции

// Читает фрагмент по UUID строкой: ссылка, текст, категория (через владельца), эффективная
// политика, хеш, вектор. Возвращает Неопределено, если фрагмента нет или он помечен на удаление.
Функция ФрагментПоUUID(Знач ФрагментUUID)
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СокрЛП(ФрагментUUID));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Ссылка = Справочники.КИИ_ФрагментыЗнаний.ПолучитьСсылку(Идентификатор);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Фрагменты.Ссылка КАК Ссылка,
		|	Фрагменты.ТекстФрагмента КАК ТекстФрагмента,
		|	Фрагменты.ХешТекстаФрагмента КАК ХешТекстаФрагмента,
		|	Фрагменты.НомерФрагмента КАК НомерФрагмента,
		|	Фрагменты.Эмбеддинг КАК Эмбеддинг,
		|	Фрагменты.Владелец КАК Владелец,
		|	База.Категория КАК Категория,
		|	ВЫБОР
		|		КОГДА База.ПолитикаЭмбеддингаПереопределение
		|				= ЗНАЧЕНИЕ(Перечисление.КИИ_ПолитикиЭмбеддинга.ПустаяСсылка)
		|			ТОГДА КатегорияЗнаний.ПолитикаЭмбеддинга
		|		ИНАЧЕ База.ПолитикаЭмбеддингаПереопределение
		|	КОНЕЦ КАК ЭффективнаяПолитика
		|ИЗ
		|	Справочник.КИИ_ФрагментыЗнаний КАК Фрагменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КИИ_БазаЗнаний КАК База
		|		ПО Фрагменты.Владелец = База.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КИИ_КатегорииЗнаний КАК КатегорияЗнаний
		|		ПО База.Категория = КатегорияЗнаний.Ссылка
		|ГДЕ
		|	Фрагменты.Ссылка = &Ссылка
		|	И НЕ Фрагменты.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Данные = Новый Структура;
	Данные.Вставить("Ссылка", Выборка.Ссылка);
	Данные.Вставить("ТекстФрагмента", Выборка.ТекстФрагмента);
	Данные.Вставить("ХешТекстаФрагмента", Выборка.ХешТекстаФрагмента);
	Данные.Вставить("НомерФрагмента", Выборка.НомерФрагмента);
	Данные.Вставить("Владелец", Выборка.Владелец);
	Данные.Вставить("Категория", Выборка.Категория);
	Данные.Вставить("ЭффективнаяПолитика", Выборка.ЭффективнаяПолитика);
	Данные.Вставить("Вектор", ВекторИзХранилища(Выборка.Эмбеддинг));
	Возврат Данные;
КонецФункции

Функция ВекторИзХранилища(Знач Хранилище)
	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Вектор = Хранилище.Получить();
	Если ТипЗнч(Вектор) = Тип("Массив") И Вектор.Количество() > 0 Тогда
		Возврат Вектор;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Выборка эмбедденных фрагментов модели (для пересборки / сверки).
Функция ФрагментыМодели(Знач КодМодели)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодМодели", КодМодели);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Фрагменты.Ссылка КАК Ссылка,
		|	Фрагменты.ТекстФрагмента КАК ТекстФрагмента,
		|	Фрагменты.ХешТекстаФрагмента КАК ХешТекстаФрагмента,
		|	Фрагменты.НомерФрагмента КАК НомерФрагмента,
		|	Фрагменты.Эмбеддинг КАК Эмбеддинг,
		|	Фрагменты.Владелец КАК Владелец,
		|	База.Категория КАК Категория,
		|	ВЫБОР
		|		КОГДА База.ПолитикаЭмбеддингаПереопределение
		|				= ЗНАЧЕНИЕ(Перечисление.КИИ_ПолитикиЭмбеддинга.ПустаяСсылка)
		|			ТОГДА КатегорияЗнаний.ПолитикаЭмбеддинга
		|		ИНАЧЕ База.ПолитикаЭмбеддингаПереопределение
		|	КОНЕЦ КАК ЭффективнаяПолитика
		|ИЗ
		|	Справочник.КИИ_ФрагментыЗнаний КАК Фрагменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КИИ_БазаЗнаний КАК База
		|		ПО Фрагменты.Владелец = База.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КИИ_КатегорииЗнаний КАК КатегорияЗнаний
		|		ПО База.Категория = КатегорияЗнаний.Ссылка
		|ГДЕ
		|	Фрагменты.КодМоделиЭмбеддинга = &КодМодели
		|	И НЕ Фрагменты.ПометкаУдаления";
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

// Размерность коллекции модели: из build-marker (запомнена при ОбеспечитьКоллекцию), иначе
// из живого фрагмента. Нужна для delete, когда фрагмент уже удален (иначе имя коллекции не собрать).
Функция РазмерностьКоллекции(Знач КодМодели)
	Отбор = Новый Структура("КодМодели", КодМодели);
	Данные = РегистрыСведений.КИИ_ПоколениеИндексаQdrant.Получить(Отбор);
	Если ЗначениеЗаполнено(Данные.Размерность) Тогда
		Возврат Данные.Размерность;
	КонецЕсли;
	Возврат РазмерностьМодели(КодМодели);
КонецФункции

Функция РазмерностьМодели(Знач КодМодели)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодМодели", КодМодели);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Фрагменты.Размерность КАК Размерность
		|ИЗ
		|	Справочник.КИИ_ФрагментыЗнаний КАК Фрагменты
		|ГДЕ
		|	Фрагменты.КодМоделиЭмбеддинга = &КодМодели
		|	И Фрагменты.Размерность > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Размерность, 0);
КонецФункции

// Запоминает размерность коллекции модели в build-marker (для delete-пути), сохраняя прочие поля.
Процедура ЗапомнитьРазмерностьКоллекции(Знач КодМодели, Знач Размерность)
	Отбор = Новый Структура("КодМодели", КодМодели);
	Текущее = РегистрыСведений.КИИ_ПоколениеИндексаQdrant.Получить(Отбор);
	Если Текущее.Размерность = Размерность Тогда
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.КИИ_ПоколениеИндексаQdrant.СоздатьМенеджерЗаписи();
	Запись.КодМодели = КодМодели;
	Запись.Поколение = Текущее.Поколение;
	Запись.ИндексПостроен = Текущее.ИндексПостроен;
	Запись.ДатаПостроения = Текущее.ДатаПостроения;
	Запись.Размерность = Размерность;
	Запись.Записать();
КонецПроцедуры

// Обрабатывает один элемент очереди: upsert свежего вектора или delete точки (wait=true).
Процедура ОбработатьЭлементОчереди(Знач ЭлементОчереди)
	Если ЭлементОчереди.Операция = "delete" Тогда
		УдалитьТочкуПоUUID(ЭлементОчереди.КодМодели, ЭлементОчереди.ФрагментИдентификатор);
		Возврат;
	КонецЕсли;

	Фрагмент = ФрагментПоUUID(ЭлементОчереди.ФрагментИдентификатор);
	Если Фрагмент = Неопределено Или Фрагмент.Вектор = Неопределено Тогда
		// Нет свежего вектора / фрагмент исчез - точку убрать (не заливать устаревшее).
		УдалитьТочкуПоUUID(ЭлементОчереди.КодМодели, ЭлементОчереди.ФрагментИдентификатор);
		Возврат;
	КонецЕсли;
	Если Не РазрешеноВИндексе(Фрагмент.ЭффективнаяПолитика) Тогда
		УдалитьТочкуПоUUID(ЭлементОчереди.КодМодели, ЭлементОчереди.ФрагментИдентификатор);
		Возврат;
	КонецЕсли;

	Размерность = Фрагмент.Вектор.Количество();
	Имя = ОбеспечитьКоллекцию(ЭлементОчереди.КодМодели, Размерность);
	Точка = ТочкаИзФрагмента(ЭлементОчереди.ФрагментИдентификатор, Фрагмент);
	Точки = Новый Массив;
	Точки.Добавить(Точка);
	Тело = Новый Структура("points", Точки);
	Ответ = ВыполнитьЗапросQdrant("PUT", "/collections/" + Имя + "/points?wait=true", Тело);
	Если Не Ответ.Успешно Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Upsert Qdrant не удался: HTTP %1 %2'"), Ответ.КодСостояния, Ответ.Тело);
	КонецЕсли;
КонецПроцедуры

// Заливает фрагмент в Qdrant (для пересборки). Требует свежего вектора.
Процедура ЗалитьФрагментВQdrant(Знач ЭлементВыборки, Знач КодМодели, Знач Размерность)
	Вектор = ВекторИзХранилища(ЭлементВыборки.Эмбеддинг);
	Если Вектор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ФрагментUUID = Строка(ЭлементВыборки.Ссылка.УникальныйИдентификатор());
	Данные = Новый Структура;
	Данные.Вставить("Вектор", Вектор);
	Данные.Вставить("Владелец", ЭлементВыборки.Владелец);
	Данные.Вставить("Категория", ЭлементВыборки.Категория);
	Данные.Вставить("НомерФрагмента", ЭлементВыборки.НомерФрагмента);
	Данные.Вставить("ХешТекстаФрагмента", ЭлементВыборки.ХешТекстаФрагмента);
	Данные.Вставить("ЭффективнаяПолитика", ЭлементВыборки.ЭффективнаяПолитика);
	Точка = ТочкаИзФрагмента(ФрагментUUID, Данные);
	Точки = Новый Массив;
	Точки.Добавить(Точка);
	Тело = Новый Структура("points", Точки);
	Имя = ИмяКоллекции(КодМодели, Размерность);
	Ответ = ВыполнитьЗапросQdrant("PUT", "/collections/" + Имя + "/points?wait=true", Тело);
	Если Не Ответ.Успешно Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Upsert Qdrant не удался: HTTP %1'"), Ответ.КодСостояния);
	КонецЕсли;
КонецПроцедуры

// Строит точку Qdrant: id (UUIDv5) + вектор + payload без текста (§6).
Функция ТочкаИзФрагмента(Знач ФрагментUUID, Знач Фрагмент)
	Payload = Новый Структура;
	Payload.Вставить("фрагмент", СокрЛП(ФрагментUUID));
	Payload.Вставить("базаЗнаний", Строка(Фрагмент.Владелец.УникальныйИдентификатор()));
	КатегорияИдентификатор = "";
	Если ЗначениеЗаполнено(Фрагмент.Категория) Тогда
		КатегорияИдентификатор = Строка(Фрагмент.Категория.УникальныйИдентификатор());
	КонецЕсли;
	Payload.Вставить("категория", КатегорияИдентификатор);
	Payload.Вставить("номер", Фрагмент.НомерФрагмента);
	Payload.Вставить("хеш", Фрагмент.ХешТекстаФрагмента);
	Payload.Вставить("политика", Строка(Фрагмент.ЭффективнаяПолитика));

	Точка = Новый Структура;
	Точка.Вставить("id", PointId(ФрагментUUID));
	Точка.Вставить("vector", Фрагмент.Вектор);
	Точка.Вставить("payload", Payload);
	Возврат Точка;
КонецФункции

// Удаляет точку фрагмента из коллекции модели (wait=true). 404 / отсутствие - идемпотентно.
// Размерность коллекции берется из build-marker (переживает удаление фрагмента) - иначе точка-сирота.
Процедура УдалитьТочкуПоUUID(Знач КодМодели, Знач ФрагментUUID)
	Размерность = РазмерностьКоллекции(КодМодели);
	Если Размерность = 0 Тогда
		// Размерность коллекции неизвестна (никогда не строилась) - удалять нечего/негде.
		Возврат;
	КонецЕсли;
	Имя = ИмяКоллекции(КодМодели, Размерность);
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить(PointId(ФрагментUUID));
	Тело = Новый Структура("points", Идентификаторы);
	Ответ = ВыполнитьЗапросQdrant("POST", "/collections/" + Имя + "/points/delete?wait=true", Тело);
	Если Не Ответ.Успешно И Ответ.КодСостояния <> 404 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Delete Qdrant не удался: HTTP %1'"), Ответ.КодСостояния);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьИндексПоля(Знач Коллекция, Знач Поле, Знач Схема)
	Тело = Новый Структура;
	Тело.Вставить("field_name", Поле);
	Тело.Вставить("field_schema", Схема);
	Ответ = ВыполнитьЗапросQdrant("PUT", "/collections/" + Коллекция + "/index?wait=true", Тело);
	// Раньше результат игнорировался: сбой создания индекса проходил молча → фильтр-поиск по полю
	// потом деградировал/падал на неиндексированной коллекции (аудит P3).
	Если Не Ответ.Успешно Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось создать индекс Qdrant %1.%2: HTTP %3 %4'"),
			Коллекция, Поле, Ответ.КодСостояния, Ответ.Тело);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьСтрокуОчереди(Знач ФрагментUUID, Знач КодМодели, Знач НомерПоПорядкуСнимка)
	Запись = РегистрыСведений.КИИ_ОчередьСинхронизацииQdrant.СоздатьМенеджерЗаписи();
	Запись.ФрагментИдентификатор = ФрагментUUID;
	Запись.КодМодели = КодМодели;
	Запись.Прочитать();
	// Гвард против гонки коалесцирования: пока элемент обрабатывался (сетевой вызов Qdrant),
	// ПоставитьВОчередь мог перезаписать строку новой операцией с бОльшим НомерПоПорядку. Удаление
	// по ключу стерло бы ее → потеря обновления (аудит P3, #158). Удаляем только исходный снимок.
	Если Запись.Выбран() И Запись.НомерПоПорядку <= НомерПоПорядкуСнимка Тогда
		Запись.Удалить();
	КонецЕсли;
КонецПроцедуры

// Тест-обертка над УдалитьСтрокуОчереди (гвард коалесцирования) для paired-eval из YAxUnit.
//
// Параметры:
//  ФрагментUUID - Строка - идентификатор фрагмента (измерение очереди).
//  КодМодели - Строка - код модели эмбеддинга (измерение очереди).
//  НомерПоПорядкуСнимка - Число - НомерПоПорядку из снимка выборки (гвард против коалесцирования).
Процедура УдалитьСтрокуОчередиДляТестов(Знач ФрагментUUID, Знач КодМодели, Знач НомерПоПорядкуСнимка) Экспорт
	УдалитьСтрокуОчереди(ФрагментUUID, КодМодели, НомерПоПорядкуСнимка);
КонецПроцедуры

Процедура ОтметитьОшибкуОчереди(Знач ЭлементОчереди, Знач ТекстОшибки)
	Запись = РегистрыСведений.КИИ_ОчередьСинхронизацииQdrant.СоздатьМенеджерЗаписи();
	Запись.ФрагментИдентификатор = ЭлементОчереди.ФрагментИдентификатор;
	Запись.КодМодели = ЭлементОчереди.КодМодели;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	Запись.Попыток = ЭлементОчереди.Попыток + 1;
	Запись.ПоследняяОшибка = Лев(ТекстОшибки, 500);
	Запись.Записать();
	ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.RAGQdrant.Очередь'"), УровеньЖурналаРегистрации.Ошибка, , ,
		Лев(ТекстОшибки, 500));
КонецПроцедуры

// Enqueue, не роняющий вызывающий цикл (rehydrate/сверка): ошибки логируются, не пробрасываются.
Процедура ПоставитьВОчередьБезопасно(Знач ФрагментUUID, Знач КодМодели, Знач Операция, Знач Хеш = "")
	Попытка
		ПоставитьВОчередь(ФрагментUUID, КодМодели, Операция, Хеш);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.RAGQdrant.Очередь'"), УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
